Repository: kirrishima/FluentDownloader
Catalog: src/FluentDownloader/Strings/*/Messages.resw
Source language: en_us
Languages: ru_ru

# FormatRetrievalErrorDescription
source: <![CDATA[Couldn't retrieve the available video formats. Error details: {0} Possible reasons: - Invalid or unsupported URL - Regional restrictions - Network issues]]>
ru_ru: <![CDATA[Не удалось получить доступные форматы видео. Детали ошибки: {0} Возможные причины: - Некорректная или неподдерживаемая ссылка - Региональные ограничения - Проблемы с сетью]]>

# FormatRetrievalErrorTitle
source: Error Fetching Video Formats
ru_ru: Ошибка при получении форматов видео

# InvalidURINotificationTitle
source: Invalid URI
ru_ru: Некорректный URI

# InvalidURINotificationDescription
source: URI can not be empty or a whitespace.
ru_ru: URI не может быть пустым или состоять из пробелов.

# SelectSavePathPlaceholder
source: Select a directory
ru_ru: Выберите директорию

# DirectoryAccessCheckerBaseTitle
source: Directory Status
ru_ru: Статус директории

# DirectoryAccessCheckerBaseSubtitle
source: Checking directory access...
ru_ru: Проверка доступа к директории...

# DirectoryAccessCheckerNullOrWhiteSpaceTitle
source: Select a directory
ru_ru: Выберите директорию

# DirectoryAccessCheckerNullOrWhiteSpaceSubtitle
source: Please select or enter a valid path
ru_ru: Выберите или введите корректный путь

# DirectoryAccessCheckerAccessible
source: Directory is accessible
ru_ru: Директория доступна

# DirectoryAccessCheckerOK
source: Directory Status: OK
ru_ru: Статус директории: ОК

# DirectoryAccessCheckerNotFoundTitle
source: Directory Status: Not Found
ru_ru: Статус директории: Не найдено

# DirectoryAccessCheckerNotFoundSubtitle
source: Directory does not exist
ru_ru: Директория не существует

# DirectoryAccessCheckerAccessDeniedTitle
source: Directory Status: Access Denied
ru_ru: Статус директории: Доступ запрещён

# DirectoryAccessCheckerAccessDeniedSubtitle
source: Access to the directory is denied
ru_ru: Доступ к директории запрещён

# DirectoryAccessCheckerIOTitle
source: Directory Status: I/O Error
ru_ru: Статус директории: Ошибка I/O

# DirectoryAccessCheckerIOSubtitle
source: I/O Error: {0}
ru_ru: I/O ошибка: {0}

# DirectoryAccessCheckerErrorTitle
source: Directory Status: Error
ru_ru: Статус директории: Ошибка

# DirectoryAccessCheckerErrorSubtitle
source: Unexpected error: {0}
ru_ru: Непредвиденная ошибка: {0}

# FetchingVideoDataLogMessage
source: Fetching video data for "{0}"
ru_ru: Получение данных видео для "{0}"

# FetchingVideoDataErorLogMessage
source: <![CDATA[Failed to fetch video data: no formats found. ]]>
ru_ru: <![CDATA[Не удалось получить данные видео: форматы не найдены. ]]>

# FetchingVideoDataSuccessLogMessage
source: <![CDATA[Formats are available in dropdown menu ]]>
ru_ru: <![CDATA[Форматы доступны в выпадающем меню ]]>

# PopUpErrorNotificationString
source: An unexpected error has occurred
ru_ru: Произошла непредвиденная ошибка

# PopUpErrorNotificationException
source: Error: {0}
ru_ru: Ошибка: {0}

# PopUpNotificationShowMore
source: Show More
ru_ru: Развернуть

# PopUpNotificationTitle
source: Full message
ru_ru: Полное сообщение

# PopUpNotificationCloseButton
source: Close
ru_ru: Закрыть

# InstallYtDlpNullPathDescription
source: <![CDATA[yt-dlp installation failed: could not resolve installation directory. This is not a common error. This issue might occur if the working directory is not set correctly or the application is running in an unexpected environment. Please ensure that the working directory is properly configured and try running the installation again."]]>
ru_ru: <![CDATA[Установка yt-dlp не удалась: не удалось определить каталог установки. Это не распространённая ошибка. Эта проблема может возникнуть, если рабочий каталог настроен неправильно или приложение запущено в неожиданной среде. Убедитесь, что рабочий каталог настроен правильно, и попробуйте запустить установку снова.]]>

# InstallYtDlpNullPathTitle
source: Error path
ru_ru: Ошибка пути

# InstallYtDlpSuccessTitle
source: yt-dlp installed successfully.
ru_ru: yt-dlp успешно установлен.

# InstallYtDlpSuccessDescription
source: <![CDATA[Version: {0}. Path: {1}]]>
ru_ru: <![CDATA[Версия: {0}. Путь: {1}]]>

# InstallYtDlpFailedTitle
source: yt-dlp Installation failed.
ru_ru: Ошибка установки yt-dlp.

# InstallYtDlpFailedDescription
source: <![CDATA[yt-dlp downloaded successfully, but is not available. Please, manually check {0} and if it exists, add it to the PATH and restart the program.]]>
ru_ru: <![CDATA[yt-dlp успешно загружен, но недоступен. Пожалуйста, вручную проверьте {0}, и если он существует, добавьте его в PATH и перезапустите программу.]]>

# InstallFfmpegNullPathTitle
source: Error path
ru_ru: Ошибка пути

# InstallFfmpegNullPathDescription
source: <![CDATA[Ffmpeg installation failed: could not resolve installation directory. This is not a common error. This issue might occur if the working directory is not set correctly or the application is running in an unexpected environment. Please ensure that the working directory is properly configured and try running the installation again."]]>
ru_ru: <![CDATA[Установка Ffmpeg не удалась: не удалось определить каталог установки. Это не распространённая ошибка. Эта проблема может возникнуть, если рабочий каталог настроен неправильно или приложение запущено в неожиданной среде. Убедитесь, что рабочий каталог настроен правильно, и попробуйте запустить установку снова.]]>

# InstallFfmpegSuccessTitle
source: Ffmpeg installed successfully.
ru_ru: Ffmpeg успешно установлен.

# InstallFfmpegSuccessDescription
source: <![CDATA[Version: {0}. Path: {1}]]>
ru_ru: <![CDATA[Версия: {0}. Путь: {1}]]>

# InstallFfmpegFailedTitle
source: Ffmpeg Installation failed.
ru_ru: Ошибка установки Ffmpeg.

# InstallFfmpegFailedDescription
source: <![CDATA[Ffmpeg downloaded successfully, but is not available. Please, manually check {0} and if it exists, add it to the PATH and restart the program.]]>
ru_ru: <![CDATA[Ffmpeg успешно загружен, но недоступен. Пожалуйста, вручную проверьте {0}, и если он существует, добавьте его в PATH и перезапустите программу.]]>

source: Operation cancelled
ru_ru: Операция отменена

# OperationCancelledForUrlFormat
source: Cancelled download for {0}
ru_ru: Загрузка для "{0}"" отменена

# ErrorWhileDownloading
source: Error while downloading "{0}"
ru_ru: Ошибка при загрузке "{0}"

source: File downloaded successfully
ru_ru: Файл успешно загружен

# FileSavedAs
source: File saved as: "{0}"
ru_ru: Файл сохранён как: "{0}"

# UnknowErrorInDonwloadVideoTitle
source: Unknow error in '{0}' function
ru_ru: Неизвестная ошибка в функции '{0}'

# UnknowErrorInDonwloadVideoDescription
source: Could not determine selected format. This is system error. Video / audio can not be downloaded. Try selecting other formats.
ru_ru: Не удалось определить выбранный формат. Это системная ошибка. Видео или аудио не может быть загружено. Попробуйте выбрать другой формат.
